## {礦工}
## “神諭”
## {強化礦工直覺,獲得附近平面10格,高度3格內的現界礦物資訊,(CT:180秒)}
## 
## “天賦”
##
## A1 {挖掘現界礦物時,獲得特殊效果}
## A2 {用鎬子造成傷害時,根據副手礦物造成額外效果}
## A3 {挖掘石頭時,勞動值+1,勞動值達30/60/90時,獲得挖掘加速效果(I/II/III)，持續15秒}
## 
## “詛咒”
## C1 {勞動值達100時,獲得過勞效果:挖掘減速(II),暈眩(I),持續10秒}

## A1
## Coal(給予4根火把)
## Copper(轉化為銅錠,並恢復0.5格飽食度)
## Diamond(獲得數量+1)
## Emerald(增加生命上限1格,(上限15格))
## Gold(轉化為金錠,並獲得吸收效果(I),持續50秒)
## Iron(轉化為鐵錠,並獲得回復效果(I),持續5秒)
## Lapis(增加5點經驗值)
## Redstone(增加5點經驗值)

## A2(Check Ore Type)
## Coal(給予最近的怪物緩速效果(II),持續10秒)
## Iron(恢復2格生命值)
## Gold(給予自身幸運效果(X),持續30秒)
## Emerald(消耗2格生命上限,(下限5格),獲得力量效果(III),持續300秒)
## Diamond(對5格範圍內的怪物造成爆炸效果,並無敵5秒)


